{
  "batch_info": {
    "batch_number": "021",
    "total_cards": 3,
    "category": "phrases",
    "source_files": ["205.txt", "208.txt", "212.txt"],
    "created_date": "2025-01-08",
    "last_updated": "2025-01-08T12:30:00Z"
  },
  "flashcards": [
    {
      "id": "phrase-021-001",
      "kikuyu": "Simple Foundation Questions",
      "english": "Wĩtagwo atĩa? (what is your name?), Ũĩkaraga kũ? (where do you stay?), Wĩ na mĩaka ĩĩgana? (how old are you?), Wendete irio irĩkũ? (what food do you like?), Thukuru/Cukuru yanyu ĩtagwo atĩa? (what is the name of your school?), Mũrata waku etagwo atĩa? (what is your friend's name?), Bũrũri wanyu wĩtagwo atĩa? (what is your country called?), Bũrũri witũ wĩtagwo Kenya (our country is called Kenya), Rũthiomi rwaku rwĩtagwo atĩa? (what is your language called?), Rũthiomi rwakwa rwĩtagwo Gĩkũyũ (my language is called Gikuyu)",
      "category": "phrases",
      "difficulty": "beginner",
      "notes": "Foundation week 4 questions covering identity, location, age, preferences, and cultural background. Shows question pattern with 'atĩa' (what) and response patterns",
      "quality_score": 4.7,
      "source": {
        "origin": "Easy Kikuyu Lesson 205",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T12:30:00Z"
      }
    },
    {
      "id": "phrase-021-002",
      "kikuyu": "Handwashing Instructions (6 Steps)",
      "english": "1. Wĩtĩrĩrie mai (wet your hands), 2. Wĩhake thabuni (apply soap), 3. Wĩthambe moko thekondi mirongo îrî (wash your hands for 20 seconds), 4. Wĩkamũre (rinse), 5. Wĩhuure na ngacibũ ya karatathi (dry with a clean paper towel), 6. Hũthĩra ngacibũ ya karatathi kũhinga mũberethi (use the paper towel to turn off the tap)",
      "category": "phrases",
      "difficulty": "intermediate",
      "notes": "Step-by-step hygiene instructions showing imperative forms with reflexive prefix wĩ-. Vocabulary: thabuni (soap), ngacibũ ya karatathi (paper towel), mũberethi (tap). Practical COVID-19 era content",
      "quality_score": 4.6,
      "source": {
        "origin": "Easy Kikuyu Lesson 208",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T12:30:00Z"
      }
    },
    {
      "id": "phrase-021-003",
      "kikuyu": "School Conversation Dialogue",
      "english": "Wee, ũka haha (you, come here), Nĩĩ? (me?), Ĩĩ wee (yes you), Njũke? (I come?), Ĩĩ ũka (yes come), Wĩtagwo atĩa? (what is your name?), Njĩtagwo Mwangi (my name is Mwangi), Kwanyu nĩ kũ? (where is your home?), Gwitũ nĩ Mũrang'a (our home is in Mũrang'a), Kwanyu gwĩtagwo mũrang'a? (your place is called mũrang'a?), Nĩ ũthiaga thukuru? (do you go to school?), Ĩĩ nĩ thiaga thukuru (yes I go to school), Thukuru yanyu ĩtagwo atĩa? (what is the name of your school?), Ĩtagwo Mũgumo-inĩ (it is called Mũgumo-inĩ), Nĩ wega. Mwarimũ wanyu etagwo atĩa? (good. What is your teacher's name?), Mwarimũ witũ etagwo Kariuki (our teacher's name is Kariuki)",
      "category": "phrases",
      "difficulty": "intermediate",
      "notes": "Complete conversation showing questioning, calling someone, identification, and school discussion. Shows subjunctive questioning pattern: Njũke? (I come?), Ĩĩ ũka (yes, come). Cultural context: asking about home region (Mũrang'a)",
      "quality_score": 4.8,
      "source": {
        "origin": "Easy Kikuyu Lesson 212",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T12:30:00Z"
      }
    }
  ]
}
