{
  "batch_info": {
    "batch_number": "027",
    "total_cards": 5,
    "category": "vocabulary",
    "source_files": ["266.txt", "267.txt", "270.txt", "271.txt", "274.txt"],
    "created_date": "2025-01-08",
    "last_updated": "2025-01-08T15:30:00Z"
  },
  "flashcards": [
    {
      "id": "vocab-027-001",
      "kikuyu": "Kinship Terms - Family System",
      "english": "Nuclear family: Baba (father), Maitũ (mother), Mũrũ wa maitũ (brother), Mwarĩ wa maitũ (sister), Murũ wa baba (half brother), Mwarĩ wa baba (half sister). Extended family: Guka/Wagũi (grandfather - Muranga/Kiambu vs Nyeri), Cũcũ (grandmother), Tata (aunt), Mama (uncle - mother's side), Baba mũnini (uncle - father's younger brother), Baba mũkũrũ (uncle - father's older brother), Mũrũ wa tata (cousin), Mũrũ wa mama (cousin). Note: All your father's brothers' wives are addressed as 'mother'",
      "category": "vocabulary",
      "difficulty": "intermediate",
      "notes": "Complete Kikuyu kinship system showing nuclear and extended family terms. Regional variation: Guka (Muranga/Kiambu) vs Wagũi (Nyeri) for grandfather. Shows cultural practice of addressing father's brothers' wives as 'mother'",
      "quality_score": 4.8,
      "source": {
        "origin": "Easy Kikuyu Lesson 266",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T15:30:00Z"
      }
    },
    {
      "id": "vocab-027-002",
      "kikuyu": "Consonants - Foundation Class B",
      "english": "b/mb (mbarĩki - castor oil), ß/b (baba - father, like Bh in Mahabharat), c (cũcũ - grandmother, like sh in Shilling), ɖ/nd (ndoro - mud), ɣ/g (guka - grandfather), h (haha - here), k (karamu - pen), m (maitũ - mother), n/ng (ngaari - car), Ŋ/ng' (Murang'a - county), dʒ/nj (njeri - woman's name), t (tene - long ago), ð/th (thaani - plate), ɲ/ny (Nyanya - tomato), Y (Yakwa - mine), W (Wanjiku - girl's name)",
      "category": "vocabulary",
      "difficulty": "advanced",
      "notes": "Complete Kikuyu consonant system with IPA notation and example words. Shows phonetic equivalents and sound comparisons. Foundation Class B linguistic material",
      "quality_score": 4.7,
      "source": {
        "origin": "Easy Kikuyu Lesson 267",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T15:30:00Z"
      }
    },
    {
      "id": "vocab-027-003",
      "kikuyu": "Clothing & Accessories - Complete",
      "english": "Nguo (clothes), Nguo cia mwĩrĩ (clothes for the body), Cati (shirt), Thuruarĩ (shorts/pants), Mũbũto (trousers), Thogithi (socks), Ngobia (hat/cap), Tai (necktie), Mĩwanĩ (spectacles), Kiratũ (shoe - singular), Iratũ (shoes - plural), Taritari (slippers), Nginyĩra (leather sandals), Gĩtabaya/Gĩtambaya (cloth), Gĩtambaya kia mũtwee (head scarf), Mĩndira (ear rings), Bangiri (bangle/s), Mbete (ring), Mũgathĩ (necklace)",
      "category": "vocabulary",
      "difficulty": "beginner",
      "notes": "Comprehensive clothing and accessories vocabulary. Shows singular/plural: Kiratũ/Iratũ (shoe/shoes). Note: Mwĩrĩ means body",
      "quality_score": 4.6,
      "source": {
        "origin": "Easy Kikuyu Lesson 270",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T15:30:00Z"
      }
    },
    {
      "id": "vocab-027-004",
      "kikuyu": "Kũhũra - Versatile Verb Meanings",
      "english": "Kũhũra (to beat/wash/make/iron/thrash/play): Kũhũra nguo (to wash clothes), Kũhũra thimũ (to make a call), Kũhũra baathi (to iron clothes), Kũhũra mboco (to thrash dry beans from pods), Kũhũra mbembe (to thrash maize), Kũhũra mũbira (to play football), Kũhũra kanua (to make clicking noise - expressing annoyance). Related: Kũrũa (to fight), Kũrũa mbaara (to fight a war), Kũhũrana (to beat each other), Mbaara (war/fight). Questions: Nũũ wahũra mwana? (who has beaten the child?), Nũũ wakũhũra? (who has beaten you?). Command: Tigai kũrũa (stop fighting)",
      "category": "vocabulary",
      "difficulty": "intermediate",
      "notes": "Highly versatile verb kũhũra with multiple context-dependent meanings. Shows Bantu polysemy where same verb root takes different meanings with different objects. Friday: Wagatano",
      "quality_score": 4.7,
      "source": {
        "origin": "Easy Kikuyu Lesson 271",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T15:30:00Z"
      }
    },
    {
      "id": "vocab-027-005",
      "kikuyu": "Character Descriptors",
      "english": "Mũndũ mũgĩ (clever person), Mũndũ mũkĩgu (foolish person), Mũndũ mwara (wise person)",
      "category": "vocabulary",
      "difficulty": "beginner",
      "notes": "Character and intelligence descriptors showing noun class agreement. Pattern: Mũndũ (person) + adjective with mũ- prefix agreement",
      "quality_score": 4.3,
      "source": {
        "origin": "Easy Kikuyu Lesson 274",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T15:30:00Z"
      }
    }
  ]
}
