{
  "batch_info": {
    "batch_number": "024",
    "total_cards": 2,
    "category": "conjugations",
    "source_files": ["236.txt", "241.txt"],
    "created_date": "2025-01-08",
    "last_updated": "2025-01-08T14:00:00Z"
  },
  "flashcards": [
    {
      "id": "conj-024-001",
      "kikuyu": "1st Person Future Tense - Later Today (with Dahl's Law)",
      "english": "Singular: Nĩ ngũ-ũka (I will come), Nĩ ngũ-rĩa (I will eat), Nĩ ngũ-kena (I will be happy), Nĩ ngũ-theka (I will laugh), Nĩ ngũ-thooma (I will read). Plural: Nĩ tũgũ-ũka (we will come), Nĩ tũkũ-rĩa (we will eat), Nĩ tũgũ-kena (we will be happy), Nĩ tũgũ-theka (we will laugh), Nĩ tũgũ-thooma (we will read)",
      "category": "conjugations",
      "difficulty": "advanced",
      "notes": "Dahl's Law: When prefix kũ- precedes verb root starting with c/t/ch/k, the k changes to g. Examples: tũkũ-kena → tũgũ-kena, tũkũ-theka → tũgũ-theka. This prevents double voiceless stops. Applies systematically across future tense",
      "quality_score": 4.8,
      "source": {
        "origin": "Easy Kikuyu Lesson 236",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T14:00:00Z"
      }
    },
    {
      "id": "conj-024-002",
      "kikuyu": "Sound & Feeling Verbs - Past & Future Conjugation",
      "english": "Past (yesterday, -ire ending): Arĩngire kanua (made noise), Abogothire (mumbled), Athĩomire (spoke with accent), Ahayire (groaned), Akororire (snorted), Aathĩmũrire (sneezed), Aiguire kĩnyĩria (was disgusted), Ethĩkĩrire (sat sadly/mourned). Future (tomorrow, -ka- marker): Akarĩnga kanua (will make noise), Akabogotha (will mumble), Akathĩoma (will speak with accent), Akahaya (will groan), Akaathĩmũra (will sneeze), Akethĩkĩra (will mourn)",
      "category": "conjugations",
      "difficulty": "intermediate",
      "notes": "Demonstrates two tenses with emotive/physical verbs. Past uses -ire perfect suffix. Future uses -ka- (distant future/tomorrow). All 3rd person singular examples. Shows systematic tense formation patterns",
      "quality_score": 4.6,
      "source": {
        "origin": "Easy Kikuyu Lesson 241",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T14:00:00Z"
      }
    }
  ]
}
