{
  "batch_info": {
    "batch_number": "020",
    "total_cards": 3,
    "category": "phrases",
    "source_files": ["195.txt", "198.txt", "204.txt"],
    "created_date": "2025-01-08",
    "last_updated": "2025-01-08T12:00:00Z"
  },
  "flashcards": [
    {
      "id": "phrase-020-001",
      "kikuyu": "Visitor Greeting Dialogue",
      "english": "Ko ko ko (knock sound), Nũũ? (who is it?), Nĩĩ nĩĩ (it is me), Nĩĩ we ũ? (who are you?), Njĩtagwo Njeri (my name is Njeri), Njeri wa ũ? (whose Njeri/who's your father?), Njeri wa Njoroge (Njeri of Njoroge), Wee wĩ mũgeni (you are a visitor), Ĩĩ nđĩ mũgeni (yes I am a visitor), Ingĩra (enter), Nyua cai (take tea), Nĩĩ nđainuka (I am off home), Thĩĩ na wega (go in peace)",
      "category": "phrases",
      "difficulty": "beginner",
      "notes": "Complete visitor arrival conversation showing traditional greeting customs. Note cultural pattern: asking lineage (Njeri wa ũ? = whose Njeri?). Ko ko ko represents door knocking sound",
      "quality_score": 4.7,
      "source": {
        "origin": "Easy Kikuyu Lesson 195",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T12:00:00Z"
      }
    },
    {
      "id": "phrase-020-002",
      "kikuyu": "Basic Questions & Identification",
      "english": "Mũirĩtu ũyũ (this girl), Aĩrĩtu aya (these girls), Ũyũ nũũ? (who is this?), Aya nĩ a? (who are these?), Etagwo atĩa? (what is his/her name?), Nĩ waragia gĩkũyũ? (do you speak Kikuyu?), Aria na nĩĩ (speak to me)",
      "category": "phrases",
      "difficulty": "beginner",
      "notes": "Common identification and question patterns. Additional vocabulary: Mbũkũ (rabbit), Nguru (tortoise). Demonstrates this/these distinction: ũyũ (this singular) vs aya (these plural)",
      "quality_score": 4.4,
      "source": {
        "origin": "Easy Kikuyu Lesson 198",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T12:00:00Z"
      }
    },
    {
      "id": "phrase-020-003",
      "kikuyu": "Meeting Arrangements & Directions",
      "english": "Nĩĩtũcemanie (let's meet), Ũkwenda tũcemanie kũ? (where do you want us to meet?), Nĩ tũcemanie mũkawainĩ (let us meet at a hotel), Mũkawa ũrikũ? (which hotel?), Ũria wĩtagwo 'Springs' (the one called Springs), Ndiũĩ (I don't know it), Haica matatu ya taũnĩ (board a matatu to town), Wakinĩya ũhũrĩre thimũ (when you arrive call me by phone), Taũnĩ nĩ nene (the town is large), Ngumĩra kũ? (where do I disembark?), Ũmĩra bothita (disembark at Posta/Post office)",
      "category": "phrases",
      "difficulty": "intermediate",
      "notes": "Complete conversation about arranging a meeting and giving directions. Modern vocabulary: matatu (minibus), thimũ (phone). Shows subjunctive use: Nĩĩtũcemanie (let's meet), Wakinĩya (when you arrive)",
      "quality_score": 4.8,
      "source": {
        "origin": "Easy Kikuyu Lesson 204",
        "created_date": "2025-01-08",
        "last_updated": "2025-01-08T12:00:00Z"
      }
    }
  ]
}
